#if !defined V302DE_DATSEG_H
#define V302DE_DATSEG_H

#if !defined(__BORLANDC__)
namespace M302de {
#endif

#include <time.h>

#include "hero.h"

/* dummy structs */
struct c_str_3 { char a[3]; };
struct c_str_5 { char a[5]; };
struct c_str_6 { char a[6]; };
struct c_str_8 { char a[8]; };
struct uint8_t_3 { uint8_t a[3]; };
struct uint8_t_32_3 { uint8_t a[32][3]; };
struct int8_t_12 { int8_t a[12]; };
struct int8_t_15 { int8_t a[15]; };
struct int16_t_3 { int16_t a[3]; };
struct int16_t_5 { int16_t a[5]; };
struct int16_t_7 { int16_t a[7]; };


struct spellrange {
	int8_t first;
	int8_t last;
};

struct mssr { struct spellrange a[9]; };

struct sample_idx {
	int8_t patch;
	int8_t bank;
	uint32_t offset;
};

struct struct_modification_timer {
	int32_t time_left;
	uint16_t offset;
	int8_t target;
	int8_t modifier;
};

struct mouse_action {
	int x1; // upper left corner
	int y1; // upper left corner
	int x2; // lower right corner
	int y2; // lower right corner
	int action;
};

struct mouse_cursor {
	uint16_t data[16];
	uint16_t mask[16];
};

struct status_bar {
	int16_t le_orig;
	int16_t le;
	int16_t ae_orig;
	int16_t ae;
};

struct struct_pic_copy {
	unsigned char *dst;
	int x1;
	int y1;
	int x2;
	int y2;
	unsigned char *src;
	int v1;
	int v2;
	int v3;
	int v4;
};

struct struct_char_width {
	char c;
	char font_id;
	char width;
};

struct struct_char_height {
	char c;
	char font_id;
	char height;
};

struct ems_tab {
	unsigned char lpage;
	unsigned char offset;
	signed short width;
	unsigned char height;
};

struct struct_memslot_ani {
	signed int figure;
	signed int ems_handle;
	uint32_t length;
};

struct struct_memslot_fig {
	signed int figure;
	uint8_t *ptr;
	signed int ems_handle;
	int32_t length;
};

struct point8s {
	int8_t x;
	int8_t y;
};

struct struct_point {
	signed short x;
	signed short y;
};

struct dng_gfxtab {
	struct struct_point a[4];
	int16_t val;
};

struct viewdir_offsets {
	struct struct_point a[4];
};

struct viewdir_offsets8s {
	struct point8s a[4];
};

struct struct_rect {
	int y1;
	int x1;
	int y2;
	int x2;
};

struct ani_tile {
	int16_t pic;
	int16_t duration;
};

/* input from file */
struct ani_area_in {
	char name[4];		//0x00
	uint16_t x;		//0x04
	uint8_t y;		//0x06
	uint8_t height;		//0x07
	uint16_t width;		//0x08
	uint8_t cyclic;		//0x0a
	int8_t pics; 		//0x0b
	int32_t offsets[20];	//0x0c
	int16_t changes;
	struct ani_tile changes_tb[42];
};

/* ingame usage */
struct ani_area {
	char name[5];
	uint16_t x;
	uint8_t y;
	uint8_t height;
	uint16_t width;
	uint8_t cyclic;
	int8_t pics;
	uint8_t* pics_tab[20];
	int16_t changes;
	struct ani_tile changes_tb[42];
};

struct struct_diary_entry {
	int16_t day;
	int16_t month;
	int16_t year;
	int16_t town_id;
};

struct special_day {
	int8_t month;
	int8_t day;
	int8_t id;
};

struct fight_msg {
	int16_t f_action;
	int16_t damage;
};

/* seg041 */
struct ranged_weapon_descr {
	/* structure of the entries of RANGED_WEAPON_TABLE */
	signed char damage_modifier[7]; /* table with damage modifiers depending on the distance */
	signed char base_handicap;
	/* According to DSA3 rules (MSZ), there are the following distance types.
	 *
	 * name         distance          encoding in Schicksalsklinge
	 * extrem nah	1-5 Schritt       0
	 * sehr nah     5-10 Schritt	  1
	 * nah          10-15 Schritt     2
	 * mittel       15-25 Schritt     3
	 * weit         25-40 Schritt     4
	 * sehr weit    40-60 Schritt     5
	 * extrem weit  61-100 Schritt    6
	 *
	 * Moreover, there are the following types of sizes of the target
	 *
	 * name         examples                                         encoding in Schicksalsklinge
	 * winzig       Silbertaler, Drachenauge, Maus, Ratte, Kroete    0
	 * sehr klein   Schlange, Fasan, Katze, Rabe                     1
	 * klein        Wolf, Reh, Kobold, Zwerg                         2
	 * mittel       Goblin, Elf, Mensch, Ork                         3
	 * gross        Pferd, Elch, Oger, Troll                         4
	 * sehr gross   Scheunentor, Drache, Elefant, Riese              5
	 *
	 * The skill test handicap for the ranged attack depends on the distance and the size of the target.
	 * In Schicksalsklinge, RANGED_WEAPON_STATS_BASE_HANDICAP is the skill test handicap vs. a target which is extrem nah and winzig (0,0).
	 * The general formula for the handicap is base_handicap + 2 * distance - 2 * target_size.
	 *
	 * The damage is calculated as the base damage of the weapon (like D6 + 3 for the shortbow) + a distance modifier.
	 * The modifier is given in the RANGED_WEAPON_STATS_DAMAGE_MODIFIER array. */
};

struct weapon_descr {
	int8_t damage_d6;
	int8_t damage_const;
	int8_t damage_kk_bonus;		/* Koerperkraft-Zuschlag */
	int8_t bf;		/* Bruchfaktor */
	int8_t ranged_index;	/* related to ranged weapons */
	int8_t at_mod;
	int8_t pa_mod;
};

struct armor_descr {
	/* https://github.com/shihan42/BrightEyesWiki/wiki/SCHICKM.EXE#R%C3%BCstungstabelle */
	/* structure of the entries of ARMORS_TABLE */
	int8_t rs; /* Rüstungsschutz */
	int8_t be; /* Behinderung */
};

struct usable_item_descr {
	int8_t unkn1;
	int8_t quantity;
	int8_t handler_id;
};

struct staffspell_descr {
	int8_t attrib1;
	int8_t attrib2;
	int8_t attrib3;
	int8_t handicap;
	int8_t ae_cost;
	int8_t ae_mod;
};

struct spell_descr {
	int8_t origin;	/* 0: druid spell; 1: mage spell; 2: witch spell; 3: green elf spell; 4: ice elf spell; 5: sylvan elf spell */
	int8_t attrib1;
	int8_t attrib2;
	int8_t attrib3;
	int8_t ae_cost;
	int8_t where_to_use;	/* -1: not in fight; 0: normal and fight; 1: only in fight */
	int8_t ani;
	int8_t target_type;
	int8_t range;
	int8_t fight;
};

struct skill_descr {
	int8_t attrib1;
	int8_t attrib2;
	int8_t attrib3;
	int8_t max_incs;
};

struct trv_start_point { /* a start_point is either a signpost or a harbor */
	int8_t town_id; /* ID of the town where the harbor/signpost is located */
	uint8_t typeindex; /* TYPEINDEX of the harbor/signpost within its town */
	uint8_t *linked_travel_routes; /* Points to the first associated entry in g_sea_routes or g_land_routes */
};

// A location is a point of interest in a town or a travel event. //
struct location {
	int16_t pos;		// coordinates of the location within its town
	int8_t loctype;		// the type of the location
	uint8_t typeindex;	// Index among the locations of the same type.
	int16_t locdata;		// Additional data, depending on the LOCTYPE.
};

struct struct_msg {
	signed int type;
	signed int id;
};

struct statuspage_line {
	int16_t x_name;
	int16_t x_val;
	int16_t y;
};

struct market {
	int16_t min_size;	/* value in {1, ..., 19} or -1 as terminator */
	int16_t price_mod;
	int16_t market_day;
	int16_t size;		/* unused */
};

/* REMARK1: DOS-Version: struct is inside the game state! */
/* REMARK2: DOS-Version: states_offset is added with a 4-Byte pointer. Not portable! */
struct struct_dialog_partner {
	uint32_t states_offset; /* TODO: Mixed with pointer: not portable! */
	int16_t txt_offset;
	char title[30];
	int16_t head_id;
};

/* REMARK: Can stay in the game state, since it's portable, but should be moved out of it */
struct struct_dialog_state {
	int16_t txt_id;	/* main txt_id >= 0 */
	uint8_t txt_id1;
	uint8_t txt_id2;
	uint8_t txt_id3;
	uint8_t state1;
	uint8_t state2;
	uint8_t state3;
};

struct struct_monster {
	int8_t mon_id;
	int8_t gfx_id;
	int8_t rs;
	uint16_t attrib[7];	/* dice template */
	uint16_t le;		/* dice template */
	uint16_t ae;		/* dice template */
	uint16_t mr;		/* dice_template */
	int8_t first_ap;
	int8_t attacks;
	int8_t at;
	int8_t pa;
	int16_t dam1;
	int16_t dam2;
	int8_t bp;
	int8_t magic;
	int8_t spellbook_id;
	int8_t level;
	int8_t size;
	int8_t is_animal;
	int8_t shots;
	int16_t shot_dam;
	int8_t throws;
	int16_t throw_dam;
	int8_t le_flee;
};

struct struct_fighter {
	signed short figure;
	signed char nvf_no;
	signed char cbx;
	signed char cby;
	signed char offsetx;
	signed char offsety;
	signed char height;
	signed char width;
	signed char x1;
	signed char y1;
	signed char x2;
	signed char y2;
	signed char reload; 	/* {0, -1	= update gfx data} */
	signed char sheet;	/* 0xe274, 0xe2a8, 0xd8ce */
	signed char wsheet;	/* 0xe274 */
	signed char id;		/* position in g_fig_list_array */
	signed char z;
	signed char visible;	/* {0, 1, 2, 3} */
	signed char double_size;/* -1 if fighter is not double_size (occupies only one square). for double_size fighter:
				 * head part: value can be used as index for g_fig_double_size_fighter_id_table which contains the fighter id);
				 * tail part: entry is +20 of the double_size entry of the head part. */
	signed char object_id;	/* stores the id of the cb_entry of the square before the fighter entered it */
	signed char is_enemy;	/* {0 = hero, 1	= enemy, 2 = hero} */
				/* strangly, at one position in seg039.cpp the value 2 is written */
	signed char sprite_id;	/* 0x12c0, 0x1531, 0x1210 */
	uint8_t* gfxbuf;
	struct struct_fighter* next;	/* TODO: These should located at the start of the structure */
	struct struct_fighter* prev;
};

struct fight_monster {
	int8_t id;
	int8_t x;
	int8_t y;
	int8_t viewdir;
	int8_t round_appear;
};

struct fight_hero {
	int8_t x;
	int8_t y;
	int8_t viewdir;
	int8_t round_appear;
};

struct fight {
	char name[19];
	int8_t intro_seen;
	int16_t scenario_id;
	struct fight_monster monsters[20];
	struct fight_hero heroes[7];
	int16_t loot[30];
	int16_t ducats;
	int16_t silver;
	int16_t heller;
};

struct mon_spell_description {
	int8_t ae_cost;
	int8_t mode;
	int8_t unkn1;
	int8_t attrib1;
	int8_t attrib2;
	int8_t attrib3;
	int8_t vs_mr;
	int8_t ani_id;
};

struct shop_item {
	int16_t item_id;
	int16_t shop_price;
	int16_t price_unit;	/* 1 = HELLER, 10 = SILVER, otherwise DUCATS */
	int8_t item_pos;
};

struct struct_smith_repairitems {
	int16_t item_id;
	int32_t pickup_time;
};

